function solve(arr1, arr2) {
  //нов масив, комбинация от 2-та;
  let newArr = [];

  //обхождаме масив-1 (имат еднаква дължина);
  for (let i = 0; i < arr1.length; i++) {
    //буферни индекс променливи от 2-та масива;
    let el1 = arr1[i];
    let el2 = arr2[i];

    if (i % 2 == 0) {
      // ако индекса на елемена е четен -> добавяме в новия масив сумата от 2-та елемента на тоя индекс (от 2-та масива)
      newArr.push(Number(el1) + Number(el2));
    } else {
      //ако индекса на елемента е нечетен -> добавяме КОНКАТЕНАЦИЯТА на 2-та елемента на този индекс (от 2-та масива);
      newArr.push(el1 + el2);
    }
  }
  // принтираме 3-тия масив, като всеки елемент е разделен от -
  console.log(newArr.join(' - '));
}
solve(['5', '15', '23', '56', '35'], ['17', '22', '87', '36', '11']); //22 - 1522 - 110 - 5636 - 46
solve(['13', '12312', '5', '77', '4'], ['22', '333', '5', '122', '44']); //35 - 12312333 - 10 - 77122 - 48
