function solve(arr) {
  //празен масив за топ интс
  let topInts = [];

  //изцикли масива
  for (let i = 0; i < arr.length; i++) {
    //буферна променлива за конкретния индекс (елемент)
    //буферна променлива която е първоначално ИСТИНА винаги
    let el = arr[i];
    let isTop = true;

    for (let j = i + 1; j < arr.length; j++) {
      let rightNum = arr[j];

      if (rightNum >= el) {
        isTop = false; //ако дори само едно число надясно е по-голямо, излизаме от този 2-ри цикъл
        break;
      }
    }
    if (isTop) {
      //ако на излизане от 2-рия цикъл нашето ЕЛ число все още е ИСТИНА, то тогава е било топ число!! и го добавяме към новия масив
      topInts.push(el);
    }
  }
  //принтирай празния масив с ДЖОЙН + спейс
  console.log(topInts.join(' '));
}

solve([1, 4, 3, 2]); //4 3 2
solve([14, 24, 3, 19, 15, 17]); //24 19 17
